foodlog/app/views/entries/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="select">
      <%= form.select :category_id, Category.all.collect { |u| [u.title, u.id] } %>