demo-blog/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 9
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 5
---
  <div class="container">
    <h2 class="subtitle is-5 has-text-weight-bold"><%= @post.comments.count %> Comments</h2>