foodlog/app/controllers/entries_controller.rb

  def index
    @entries = Entry.where("created_at >= ?", Date.today)
---
SELECT "entries".* FROM "entries" WHERE (created_at >= '2025-01-03')

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("meal_type", "calories", "proteins", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "1234"], ["calories", 143], ["proteins", 134], ["carbohydrates", 1234], ["fats", 13], ["created_at", "2025-01-03 17:21:58.141637"], ["updated_at", "2025-01-03 17:21:58.141637"]]

  def update
    respond_to do |format|
      if @entry.update(entry_params)
---
UPDATE "entries" SET "updated_at" = ?, "category_id" = ? WHERE "entries"."id" = ?  [["updated_at", "2025-01-03 17:59:00.588591"], ["category_id", 1], ["id", 23]]