demo-blog/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params.require(:comment).permit(:name, :comment))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 9 LIMIT 1
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES ('Mohanad', 'This is a very amazing article', '2025-01-05 16:32:49.570541', '2025-01-05 16:32:49.570541', 9) RETURNING "id"