demo-blog/app/controllers/posts_controller.rb

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "content" = 'In today’s fast-paced world, where distractions are abundant and stress levels are high, the practice of mindfulness has emerged as a powerful tool for enhancing mental well-being and improving overall quality of life. Mindfulness is the art of being present in the moment, fully engaging with our thoughts, feelings, and surroundings without judgment.